In [16]:
import pandas as pd

In [17]:
pwd

'/Users/amodpathirana/ML Tensorflow/Tensorflow-Basics/Pandas'

In [18]:
ls

Pandas Crash Course .ipynb  try1.ipynb
salaries.csv

In [19]:
df=pd.read_csv('Salaries.csv')
df.head()

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [20]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [21]:
df[['Salary', "Age"]]

   Salary  Age
0   50000   34
1  120000   45
2   80000   27

In [22]:
df["Salary"].min()

50000

In [23]:
df["Salary"].max()

120000

In [24]:
df["Salary"].mean()

83333.33333333333

In [25]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [26]:
df.values

array([['John', 50000, 34],
       ['Sally', 120000, 45],
       ['Alyssa', 80000, 27]], dtype=object)

In [27]:
df.head()

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [28]:
df.describe

<bound method NDFrame.describe of      Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27>

In [29]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [30]:
my_filter=df["Salary"]>60000
df[my_filter]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27